{
  "project": "MyCodex – Autonomous Coding Agent",
  "version": "2.0.0",
  "phases": [
    {
      "id": "phase_0",
      "status": "completed",
      "summary": "Repository skeleton, config system, minimal CLI/daemon, CI and initial docs are implemented."
    },
    {
      "id": "phase_1",
      "status": "completed",
      "summary": "LLM layer contracts, provider registry, OpenAI-compatible and Ollama providers, and mock provider are implemented with basic streaming stubbed."
    },
    {
      "id": "phase_2",
      "status": "completed",
      "summary": "HTTP NDJSON streaming endpoint /agent/run and mycodex run CLI are implemented with basic RPC message types and tests."
    },
    {
      "id": "phase_3",
      "status": "completed",
      "summary": "Basic Agent Core, AgentRunner bridge, session history, prompt builders, and context injection are wired into the daemon."
    },
    {
      "id": "phase_4",
      "status": "completed",
      "summary": "Filesystem and terminal tools with safe path guards and tool registry are implemented and documented."
    },
    {
      "id": "phase_5",
      "status": "completed",
      "summary": "Multi-step agent loop with max_steps enforcement, finish heuristics, and step metadata streaming is implemented and tested."
    },
    {
      "id": "phase_6",
      "status": "completed",
      "summary": "Sandbox builder wiring FS/terminal tools by config flags is added with traversal prevention tests and initial security docs."
    },
    {
      "id": "phase_7",
      "status": "completed",
      "summary": "Prometheus-based observability with agent metrics, /metrics endpoint, and token usage accounting is integrated and documented."
    },
    {
      "id": "phase_8",
      "status": "completed",
      "summary": "Git tool with status and dry-run apply_patch plus initial tool schemas for fs/terminal/git is implemented and documented."
    },
    {
      "id": "phase_9",
      "status": "completed",
      "summary": "Tool schemas are exposed via /tools/schemas, and daemon builds sandbox+tool registry injected into the agent runner."
    },
    {
      "id": "phase_10",
      "status": "completed",
      "summary": "Basic tool-call execution for fs/terminal/git in AgentRunner is implemented with schema endpoint and tool execution tests."
    },
    {
      "id": "phase_11",
      "status": "completed",
      "summary": "Minimal tool-call validation, pre-step tool execution, CLI --tools support, and updated docs for tool-call flow are added."
    },
    {
      "id": "phase_12",
      "status": "completed",
      "summary": "Agent loop can parse simple JSON tool-call instructions from model responses, execute them mid-run, and stream tool events."
    },
    {
      "id": "phase_13",
      "status": "completed",
      "summary": "Git apply_patch safety is hardened with dry-run enforcement under restricted sandbox; agent executes parsed tool-calls mid-loop."
    },
    {
      "id": "phase_14",
      "status": "completed",
      "summary": "Schema-based tool-call validation and fenced JSON extraction are implemented with extended validator tests and docs."
    },
    {
      "id": "phase_15",
      "status": "completed",
      "summary": "Git apply backups before apply are added with default .mycodex/patch-backups storage and enforced dry-run in restricted modes."
    },
    {
      "id": "phase_16",
      "status": "completed",
      "summary": "Restore_backup tool is implemented to reverse latest saved patch, and docs cover backup/rollback behaviour."
    },
    {
      "id": "phase_17",
      "status": "completed",
      "summary": "Backup management tools (list_backups, preview_backup, restore_backup) are implemented with updated schemas and docs."
    },
    {
      "id": "phase_18",
      "status": "completed",
      "summary": "Per-session planning step with cached plan injection into prompts and streamed plan events is implemented and documented."
    },
    {
      "id": "phase_19",
      "status": "completed",
      "summary": "Reflection step after each turn and optional test-run phase via sandboxed terminal are added and integrated into CLI/RPC/config."
    },
    {
      "id": "phase_20",
      "status": "completed",
      "summary": "Sandbox denies common network commands when allow_network is false, with terminal validation and security docs updated."
    },
    {
      "id": "phase_21",
      "status": "completed",
      "summary": "Context file loading via context_paths/--context with guard and max_context_bytes limit is implemented and tested."
    },
    {
      "id": "phase_22",
      "status": "planned",
      "title": "Connect RPC Bidirectional Streaming & Session Management",
      "description": "Перевод RPC протокола с NDJSON HTTP на полноценный Connect RPC с двунаправленным стримингом, сессиями, отменами и backpressure.",
      "tasks": [
        "Определить protobuf/Connect схемы для двунаправленного стрима RunTask (RunTaskRequest/RunTaskEvent) с поддержкой сессий.",
        "Добавить поле session_id и correlation_id в RPC сообщения и пронести их через все слои (CLI, daemon, agent runner, логи).",
        "Сгенерировать Connect RPC серверные и клиентские stubs и интегрировать их в mycodexd и mycodex CLI.",
        "Реализовать серверный обработчик RunTask с отдельными горутинами для приёма запросов и отправки событий, с корректной синхронизацией.",
        "Реализовать клиентский обработчик стрима в CLI: обработка событий, рендеринг токенов, планов, рефлексий, tool-events, тестов.",
        "Добавить поддержку session multiplexing: несколько одновременных RunTask стримов на одном daemon с изоляцией состояния.",
        "Реализовать протокол graceful cancellation: пользовательский interrupt в CLI должен отправлять cancel и завершать серверный стрим.",
        "Добавить управление backpressure: корректно обрабатывать медленных клиентов без переполнения буферов и утечек памяти.",
        "Интегрировать новый Connect RPC слой с существующим AgentRunner и заменить NDJSON handler на новый транспорт.",
        "Добавить флаг/конфиг для выбора транспорта (legacy NDJSON vs Connect RPC) для плавной миграции.",
        "Написать интеграционные тесты для сценариев: нормальный поток, ранний cancel, медленный клиент, разрыв сети.",
        "Добавить unit-тесты на преобразование RunTaskRequest/RunTaskEvent между HTTP/NDJSON и Connect моделями (если поддерживается back-compat).",
        "Обновить docs/rpc.md с описанием Connect RPC, структуры сообщений, семантики сессий и примеров взаимодействия.",
        "Добавить метрики для Connect RPC: количество активных сессий, средняя длительность сессии, количество ошибок транспорта.",
        "Убедиться, что логирование включает session_id и correlation_id для полноценного трейсинга запросов."
      ],
      "deliverables": [
        "Рабочий Connect RPC двунаправленный стрим между mycodex CLI и mycodexd.",
        "Поддержка нескольких одновременных сессий и корректных отмен.",
        "Обновлённая документация по RPC протоколу и сессиям.",
        "Набор тестов, покрывающий нормальные и аварийные сценарии стриминга."
      ],
      "DoD": [
        "CLI и daemon по умолчанию используют Connect RPC стрим вместо NDJSON.",
        "Интеграционные тесты на cancel, разрыв соединения и медленного клиента проходят стабильно.",
        "Метрики и логи позволяют однозначно проследить поток одного запроса по session_id/correlation_id.",
        "NDJSON режим либо удалён, либо официально помечен как legacy и отключаемый через конфиг."
      ],
      "notes": "Это фундаментальный сдвиг транспорта: важно сохранить обратимую миграцию и чёткое логирование для дебага."
    },
    {
      "id": "phase_23",
      "status": "planned",
      "title": "Semantic Context Engine & Relevance-Based File Selection",
      "description": "Добавление семантического движка контекста для автоматического выбора релевантных файлов и фрагментов кода по запросу агента.",
      "tasks": [
        "Выбрать и интегрировать провайдер эмбеддингов (OpenAI, локальная модель через HTTP, или встроенная библиотека) через абстрактный интерфейс.",
        "Определить структуру хранилища эмбеддингов на проект: схема для файлов, фрагментов и символов (возможен BoltDB/SQLite/pluggable backend).",
        "Реализовать индексатор проекта: обход дерева файлов с respect к ignore-паттернам, генерация эмбеддингов для содержимого и сохранение в индекс.",
        "Добавить конфиг-секции для семантического индекса: размер чанка, минимальная длина, исключаемые пути, период обновления.",
        "Реализовать API для similarity search: top-K релевантных файлов/фрагментов по текстовому запросу или ошибке теста.",
        "Интегрировать semantic search в AgentRunner: отдельный шаг выбора контекста перед планированием/исполнением.",
        "Добавить специальный tool semantic_search, который LLM может вызывать для получения релевантных файлов по описанию задачи.",
        "Реализовать стратегию слияния контекста: релевантные фрагменты + явно запрошенные пользователем файлы + история сессии.",
        "Ввести лимиты: max_context_bytes и max_files_per_step для semantic engine, с эвристиками при превышении.",
        "Реализовать summarization для больших файлов: LLM-based summary или rule-based, с сохранением в кэш.",
        "Добавить unit-тесты для индексатора, поиска и контекст-мёржа (включая edge-cases: бинарные файлы, большие файлы, пустые директории).",
        "Добавить интеграционные тесты: задача, когда нужный файл не указан явно, но должен быть найден по semantic search.",
        "Обновить docs/context_handling.md и создать docs/semantic_engine.md с описанием конфигов и примером сценариев.",
        "Добавить метрики: количество semantic запросов, latency поиска, количество возвращённых файлов, cache hit/miss.",
        "Оптимизировать индексатор: батчинг эмбеддингов, инкрементальное обновление при изменении файлов (по mtime или git)."
      ],
      "deliverables": [
        "Семантический индекс проекта с возможностью искать релевантные файлы по текстовому описанию.",
        "Интеграция semantic search в агент: автоматическая подгрузка нужных файлов и фрагментов.",
        "Документация по semantic engine и конфигурируемым опциям.",
        "Тесты, демонстрирующие успешное решение задач без явного указания файлов пользователем."
      ],
      "DoD": [
        "Агент способен находить и использовать релевантные файлы, когда пользователь описывает задачу без прямого указания путей.",
        "Semantic engine устойчив к большим репозиториям (проверено на тестовой кодовой базе).",
        "Метрики показывают адекватное время ответа поиска и отсутствие существенных утечек памяти.",
        "Документация описывает как включить/отключить semantic engine и его ограничения."
      ],
      "notes": "Это ключ к поведению уровня Cursor: агент должен сам находить файлы, а не полагаться только на явный контекст."
    },
    {
      "id": "phase_24",
      "status": "planned",
      "title": "Reflection Engine v2: Structured Critique & Self-Diff",
      "description": "Усиление рефлексии агента через структурированную критику, само-проверку и сравнение патчей с исходным кодом.",
      "tasks": [
        "Определить JSON-схему для ответа критики (critique_response), включающую поля: оценка качества, список проблем, рекомендации.",
        "Добавить отдельный режим вызова модели для критики (reflect step v2), отличающийся от основного code-generation режима.",
        "Реализовать генерацию промпта для критики: включение части плана, патча, diff и результатов тестов.",
        "Добавить функциональность self-diff: сравнивать оригинальный код и предложенный патч для поиска пропущенных мест или регрессий.",
        "Встроить critique шаг между генерацией патча и его применением, с возможностью блокировать применение при обнаружении критических проблем.",
        "Реализовать эвристику для auto-fix по результатам критики: дополнительный шаг, который улучшает патч до apply.",
        "Добавить конфиг-параметры для включения/выключения advanced reflection и уровня строгости критики.",
        "Расширить RunTaskEvent, чтобы стримить события критики (critique events) в CLI и отображать их пользователю.",
        "Добавить unit-тесты для Reflection Engine: корректность формата схемы, генерации промптов и обработки ответов.",
        "Добавить интеграционные тесты: сценарии, когда критика предотвращает опасный или некорректный патч.",
        "Интегрировать результаты критики в логи и метрики: количество отклонённых патчей, доля успешных auto-fix попыток.",
        "Обновить docs/agent.md и docs/reflect.md с описанием улучшенного цикла Plan → Act → Reflect v2.",
        "Добавить фолбек-режим: при невозможности корректно распарсить critique JSON патч либо блокируется, либо помечается как рискованный.",
        "Реализовать конфигурируемый policy: auto-apply, require-confirmation, or block-on-critical по результатам критики.",
        "Проверить совместимость с существующим планом и тест-раннером, чтобы цикл не становился бесконечным."
      ],
      "deliverables": [
        "Улучшенный Reflection Engine, позволяющий агенту критически оценивать свои патчи.",
        "Структурированная JSON-критика, встроенная в цикл принятия решений об apply_patch.",
        "Документация и примеры сценариев, где рефлексия предотвращает ошибки или улучшает код."
      ],
      "DoD": [
        "Агент способен отклонять свои же патчи на основе критики и предлагать улучшенные версии.",
        "Critique JSON стабильно парсится и валидируется по схеме во всех целевых моделях.",
        "Интеграционные тесты показывают снижение количества некорректных патчей в end-to-end сценариях.",
        "Документация описывает, как настроить уровень строгости рефлексии и её влияние на workflow."
      ],
      "notes": "Это шаг к поведению «Senior разработчика»: агент не только генерирует код, но и проверяет себя перед применением изменений."
    },
    {
      "id": "phase_25",
      "status": "planned",
      "title": "Patch Cycle Engine v2: Stacked Patches & Lineage",
      "description": "Расширение текущего патч-движка до многошаговой системы с патч-стеком, lineage и гибким откатом.",
      "tasks": [
        "Определить модель данных для patch stack: идентификаторы патчей, родительские связи, метаданные (описание, время, причина).",
        "Реализовать хранилище для стека патчей (на базе файловой системы или небольшого локального DB) с возможностью перечисления и фильтрации.",
        "Добавить API для создания нового patch entry при каждом apply_patch (даже при dry-run, с пометкой типа).",
        "Реализовать операции squash: объединение нескольких патчей в один крупный патч с сохранением lineage.",
        "Добавить операцию rebase патчей поверх обновлённого head-состояния (при изменениях пользователя или git pull).",
        "Интегрировать patch stack с существующей системой backup/restore, унифицировать понятия backup и patch entry.",
        "Добавить CLI-команды для просмотра стека патчей, их фильтрации и управления (list, show, squash, drop, rebase).",
        "Интегрировать patch lineage в агент: планирование нескольких последовательных патчей с возможностью возврата на предыдущий уровень.",
        "Добавить интеграцию с git: возможность автоматически создавать lightweight ветку или commit из выбранного патча или их группы.",
        "Реализовать защиту от конфликтов: детектировать конфликтующие патчи и помечать их как требующие ручного вмешательства.",
        "Добавить unit-тесты для patch stack операций (создание, squash, rebase, drop, restore).",
        "Добавить интеграционные тесты: сценарий многократных изменений в проекте с возвратом на несколько шагов назад.",
        "Обновить docs/tools.md и создать отдельный docs/patch_engine.md для описания новой патч-архитектуры.",
        "Добавить метрики: количество патчей в стеке, количество откатов, средняя глубина стека.",
        "Обеспечить обратно совместимое поведение для существующих сценариев, использующих только single backup."
      ],
      "deliverables": [
        "Patch Engine v2 с поддержкой стека патчей, lineage и сложных сценариев отката.",
        "CLI-команды и агентные сценарии, использующие многошаговые патч-циклы.",
        "Документация по работе с патч-стеком и интеграции с git."
      ],
      "DoD": [
        "Пользователь и агент могут видеть историю патчей и возвращаться на любой предыдущий шаг.",
        "Сложные сценарии последовательных изменений и откатов проходят интеграционные тесты без потери данных.",
        "Patch Engine v2 не ломает существующие simple-сценарии (single patch + backup).",
        "Документация ясно объясняет патч-стек, lineage и основные команды управления."
      ],
      "notes": "Этот слой выводит патч-менеджмент MyCodex на уровень и выше IDE-агентов: появляется полноценный временной континуум патчей."
    },
    {
      "id": "phase_26",
      "status": "planned",
      "title": "Test-Driven Agent Workflow & Failure-Oriented Repair",
      "description": "Построение полноценного тест-ориентированного цикла: запуск тестов, парсинг ошибок, автоматическое исправление и повторный прогон.",
      "tasks": [
        "Определить JSON-схему для описания результатов тестов: список упавших тестов, сообщений об ошибках, трасс стека.",
        "Реализовать расширенный test-run tool, который запускает команды (go test, pytest, npm test и др.) и возвращает структурированный результат.",
        "Добавить парсер вывода тестов для Go, JS/TS, Python (и общий fallback) с выделением ключевых сообщений и файлов/строк.",
        "Интегрировать test-run шаг в AgentRunner: возможность вызывать тесты в начале, середине и конце цикла.",
        "Разработать стратегию test-driven цикла: run tests → анализ → generate fix → apply patch → re-run tests.",
        "Добавить конфиг-параметры для test_command per проект/язык и для лимитов по времени и количеству перезапусков.",
        "Интегрировать результаты тестов в планирование и рефлексию: план должен учитывать конкретные упавшие тесты.",
        "Добавить unit-тесты для парсеров тестового вывода и их маппинга в структурированный формат.",
        "Добавить интеграционные тесты: end-to-end сценарий, где агент исправляет фейлящийся тест в реальном репо.",
        "Расширить RunTaskEvent, чтобы включать детализацию тестовых прогонов и отображать их в CLI.",
        "Добавить метрики: количество тестовых прогонов, доля успешных фиксов, среднее количество итераций до зелёных тестов.",
        "Обновить docs/agent.md и docs/tests.md с описанием test-driven агентного режима.",
        "Реализовать защиту от бесконечных циклов: лимиты на количество test-fix итераций и таймауты.",
        "Добавить возможность запускать только subset тестов (по имени/паттерну), если это поддерживается пользователем или конфигом.",
        "Убедиться, что тест-раннер уважает sandbox настройки (allow_exec, allow_network, ограничение по пути)."
      ],
      "deliverables": [
        "Полноценный тест-ориентированный цикл работы агента с автоматическим исправлением упавших тестов.",
        "Структурированный формат результатов тестов, доступный агенту для reasoning.",
        "Документация и примеры проектов, где агент успешно чинит тесты end-to-end."
      ],
      "DoD": [
        "На наборе демонстрационных репозиториев агент способен самостоятельно довести тесты до зелёного состояния.",
        "Парсер тестов извлекает ключевую информацию и верно мапит её на файлы/строки.",
        "Интеграционные тесты демонстрируют устойчивое поведение при повторных неудачных попытках (не зацикливается).",
        "Документация ясно описывает, как настроить test-driven режим и ограничения по ресурсам."
      ],
      "notes": "Тест-ориентированный цикл — одна из ключевых отличительных черт продвинутых код-агентов уровня Cursor/Devin."
    },
    {
      "id": "phase_27",
      "status": "planned",
      "title": "Multi-Model Orchestrator & Strategy Layer",
      "description": "Оркестратор моделей, позволяющий использовать разные LLM для планирования, генерации патчей, критики и вспомогательных задач.",
      "tasks": [
        "Определить конфигурационный формат для стратегий выбора моделей: per-step, per-role (planner, coder, critic), per-task.",
        "Расширить модельный registry, чтобы поддерживать именованные роли (например, planner_model, coder_model, critic_model).",
        "Реализовать StrategyEngine, который на основе текущего состояния цикла (plan/act/reflect/test) выбирает подходящую модель.",
        "Интегрировать StrategyEngine в AgentRunner, заменив прямые вызовы к единственной модели на стратегически выбранную.",
        "Добавить конфиг для fallback стратегий: при ошибке или плохом ответе одной модели переиспользовать другую.",
        "Реализовать метрики качества: сравнение успешности патчей и исправлений при разных комбинациях моделей.",
        "Добавить возможность указать per-project и per-task overrides для моделей через конфиг или CLI флаги.",
        "Интегрировать multi-model поддержку с Reflection Engine v2: критика может выполняться отдельной моделью.",
        "Добавить unit-тесты для StrategyEngine, симулируя различные сценарии выбора моделей.",
        "Добавить интеграционные тесты: сценарии, где для планирования используется одна модель, а для кода другая.",
        "Обновить docs/models.md и создать docs/strategy.md с описанием стратегий, примерами конфигов и рекомендациями.",
        "Добавить метрики: использование каждой модели, количество ошибок, средняя длина ответов, время ответа.",
        "Реализовать защиту от избыточных расходов: лимиты на использование дорогих моделей и fallback на локальные.",
        "Интегрировать логирование выбора модели в observability слой для пост-анализа.",
        "Обеспечить обратную совместимость: при отсутствии настроек стратегий работает как single-model режим."
      ],
      "deliverables": [
        "Multi-model orchestration слой, позволяющий комбинировать LLM для разных ролей и задач.",
        "Стратегии выбора модели, которые повышают качество кода и устойчивость workflows.",
        "Документация по настройке и эксплуатации multi-model режима."
      ],
      "DoD": [
        "Агент способен использовать разные модели для планирования, генерации и критики в рамках одной задачи.",
        "Простые конфиги работают out-of-the-box, сложные сценарии стратегий покрыты примерами.",
        "Метрики и логи позволяют анализировать вклад каждой модели в успешность решений.",
        "Обратная совместимость с single-model режимом не нарушена."
      ],
      "notes": "Multi-model стратегия — ключевая фича для баланса стоимости и качества, позволяющая приблизиться к поведению Cursor/Devin."
    },
    {
      "id": "phase_28",
      "status": "planned",
      "title": "Tool-Calling Finite State Machine (FSM) for Agent Workflows",
      "description": "Введение конечного автомата состояний для жёсткого определения допустимых tool-calls и действий агента на каждом шаге цикла.",
      "tasks": [
        "Определить формальную модель FSM для агентного цикла: состояния (PLAN, ANALYZE, EDIT, TEST, REFLECT, DONE) и переходы.",
        "Разработать DSL или структурированный конфиг для описания FSM: допустимые инструменты и типы LLM вызовов в каждом состоянии.",
        "Реализовать FSMEngine, который хранит текущее состояние задачи и проверяет допустимость действий (LLM-вызовов и tools).",
        "Интегрировать FSMEngine в AgentRunner, чтобы каждый шаг цикла явно проходил через состояние и переход.",
        "Ограничить tool-calls: в каждом состоянии разрешать только определённый подмножество инструментария (например, EDIT → git/apply_patch, TEST → test-run).",
        "Добавить логику отката состояния или повторного шага в случае ошибок инструментов или невалидных ответов модели.",
        "Реализовать визуализацию FSM (например, генерация диаграммы в текстовом/JSON формате для docs и дебага).",
        "Добавить unit-тесты для FSMEngine: корректные и некорректные последовательности действий, переходы, ошибки.",
        "Добавить интеграционные тесты: end-to-end сценарии, проверяющие, что агент не использует недопустимые инструменты не в тех состояниях.",
        "Обновить docs/agent.md с разделом про FSM и примерами конфигураций рабочего цикла.",
        "Интегрировать FSM события в логи и метрики: текущее состояние, количество переходов, частота ошибок состояний.",
        "Добавить поддержку нескольких преднастроенных профилей FSM (aggressive, safe, test-driven-first).",
        "Реализовать fallback-переходы: что делать, если модель вернула неожиданный тип ответа в конкретном состоянии.",
        "Интегрировать FSM с Reflection Engine и Test-Runner: REFLECT и TEST должны быть полноценными отдельными состояниями.",
        "Обеспечить механизм миграции: предыдущие сценарии без FSM работают в режиме default FSM с максимально слабой ограниченностью."
      ],
      "deliverables": [
        "FSM для агентного цикла, определяющий строгий порядок действий и допустимые инструменты.",
        "Конфигурируемые профили процессов (например, test-first, patch-first, планирование-затем-редактирование).",
        "Документация и диаграммы, описывающие поведение FSM агента."
      ],
      "DoD": [
        "Агент более не может произвольно вызывать инструменты вне допустимого контекста состояния.",
        "End-to-end тесты подтверждают предсказуемое и воспроизводимое поведение workflow.",
        "FSM профили могут быть переключены конфигом и визуально понятны по документации.",
        "Старые сценарии совместимы через default FSM профиль."
      ],
      "notes": "FSM делает агента предсказуемым и управляемым, что критично для доверия в production-средах."
    },
    {
      "id": "phase_29",
      "status": "planned",
      "title": "Intelligent Filetree Mapping & Code Navigation Graph",
      "description": "Построение карты проекта и графа зависимостей для более умного анализа, навигации и контекстного выбора.",
      "tasks": [
        "Реализовать сканер дерева проекта, который собирает информацию о файлах, модулях, пакетах и их зависимостях.",
        "Для языков с явными импортами (Go, TS, Python) реализовать парсинг импортов и построение графа зависимостей между файлами/модулями.",
        "Добавить извлечение символов (функции, классы, методы, интерфейсы) и их местоположений для ключевых языков.",
        "Реализовать индекс символов с поиском по имени и возможностью находить все использования (approx via text/AST).",
        "Добавить tools: find_symbol, list_references, goto_definition, list_module_files.",
        "Интегрировать навигационные инструменты в AgentRunner: агент может явно запрашивать структуру проекта и навигацию по символам.",
        "Добавить конфиг для включения/выключения глубокой навигации по языкам и для задавания ограничений по размерам.",
        "Реализовать кэширование результатов анализа дерева и графа зависимостей, обновление при изменении файлов.",
        "Добавить unit-тесты для парсеров импортов и извлечения символов для нескольких языков.",
        "Добавить интеграционные тесты: сценарии, где агент должен найти определённый символ/модуль и отредактировать его.",
        "Интегрировать навигационный граф с Semantic Context Engine (phase_23) для улучшения качества выбора контекста.",
        "Обновить документацию (docs/context_handling.md, docs/tools.md) с описанием новых навигационных возможностей.",
        "Добавить метрики: количество вызовов навигационных tools, latency, hit rate по символам.",
        "Обеспечить graceful degradation: если язык не поддерживается для глубокой навигации, fallback на более простые механизмы.",
        "Продумать и реализовать API для будущей интеграции с возможным UI (web/IDE) поверх навигационного графа."
      ],
      "deliverables": [
        "Карта проекта и граф зависимостей с индексом символов и инструментами навигации.",
        "Возможности find_symbol/list_references/goto_definition для ключевых языков.",
        "Интеграция графа с контекстным и агентным слоями."
      ],
      "DoD": [
        "Агент способен находить и редактировать нужные сущности (функции/классы) по имени без явной информации от пользователя.",
        "Навигационные инструменты покрыты тестами и ведут себя предсказуемо на реальных проектах.",
        "Документация объясняет, какие языки поддерживаются и как работает навигация.",
        "Система gracefully деградирует для проектов без формальной структуры или для малоизвестных языков."
      ],
      "notes": "Эта фаза приближает MyCodex к возможностям IDE-уровня, как у Cursor/JetBrains с встроенным AI."
    },
    {
      "id": "phase_30",
      "status": "planned",
      "title": "Agent Long-Term Memory & Project Knowledge Base",
      "description": "Добавление долговременной памяти агента и базы знаний проекта для использования прошлых решений, стиля и архитектуры.",
      "tasks": [
        "Определить модель long-term памяти: какие события/решения/факты сохраняются и в каком формате (текст, эмбеддинги, структурированные записи).",
        "Реализовать слой хранения памяти per проект (BoltDB/SQLite/плагинный backend) с версионированием и GC старых записей.",
        "Добавить механизм автоматического логирования ключевых событий: успешные фиксы, сложные патчи, принятые архитектурные решения.",
        "Интегрировать эмбеддинги памяти: возможность запросить релевантные прошлые события по текущей задаче.",
        "Добавить memory tool, который агент может вызывать для чтения/записи записей памяти (с явной JSON-схемой).",
        "Реализовать конфиг для объёма и типа сохраняемой памяти (минимальная/стандартная/расширенная).",
        "Интегрировать память в планирование и рефлексию: план должен учитывать прошлые похожие задачи и решения.",
        "Добавить unit-тесты для слоя памяти: сохранение, поиск, удаление, компрессия.",
        "Добавить интеграционные тесты: сценарии, где агент второй раз решает похожую задачу быстрее и безопаснее за счёт памяти.",
        "Обновить документацию (docs/agent.md, docs/memory.md) с описанием модели памяти и рекомендаций по конфигурации.",
        "Добавить метрики: размер памяти, количество обращений, hit/miss rate, latency запросов к памяти.",
        "Реализовать конфиденциальностные/безопасностные настройки: возможность полностью отключить память или очищать её по запросу.",
        "Интегрировать память с Semantic Context Engine и навигацией для построения richer контекста.",
        "Добавить механизмы миграции и обновления схемы памяти между версиями MyCodex.",
        "Убедиться, что память не ломает stateless сценарии: при отключении память не используется и не создаётся."
      ],
      "deliverables": [
        "Долговременная память агента per проект, используемая для улучшения качества решений.",
        "Инструменты чтения/записи в память, доступные LLM через регламентированные tool-calls.",
        "Документация и примеры, демонстрирующие пользу памяти в повторяющихся задачах."
      ],
      "DoD": [
        "Агент демонстрирует улучшение в повторяющихся задачах за счёт использования памяти.",
        "Память конфигурируема, безопасна и может быть полностью отключена.",
        "Тесты подтверждают корректную работу памяти и отсутствие критических утечек.",
        "Документация ясно объясняет модель памяти и её trade-offs."
      ],
      "notes": "Это шаг от «сессионного ассистента» к постоянному напарнику-разработчику, который помнит историю проекта."
    },
    {
      "id": "phase_31",
      "status": "planned",
      "title": "Advanced Security Sandbox v2: Containerized & Resource-Limited",
      "description": "Усиление sandbox через контейнеризацию (Docker/подобное), ограничение ресурсов и изоляцию сети/процессов.",
      "tasks": [
        "Определить целевой механизм контейнеризации (Docker, podman, firejail, nsjail) и абстрактный интерфейс SandboxBackend.",
        "Реализовать SandboxBackend, создающий изолированные окружения для запуска тестов и команд (PID, mount, user, network namespaces).",
        "Добавить конфиг для выбора sandbox backend (process-only vs containerized) и параметров (CPU/memory лимиты, network mode).",
        "Интегрировать контейнеризированный sandbox с существующим terminal tool и test-run tool.",
        "Реализовать ограничение ресурсов: CPU shares/limits, memory limit, ограничения времени выполнения.",
        "Добавить поддержку монтирования рабочего директория в контейнер (read-only/read-write в зависимости от политики).",
        "Реализовать network isolation: возможность запускать задачи без доступа к сети даже при наличии сетевых команд.",
        "Добавить unit-тесты для абстракций sandbox backend (моки для Docker/подобного).",
        "Добавить интеграционные тесты: запуск тестов и команд внутри контейнера, проверка изоляции и лимитов.",
        "Обновить docs/security.md с описанием расширенного sandbox, возможных backend-ов и требований к окружению.",
        "Добавить метрики: количество контейнеризированных запусков, среднее потребление ресурсов, количество ошибок sandbox.",
        "Реализовать graceful handling ошибок sandbox (невозможно создать контейнер, лимиты превышены и т.д.).",
        "Убедиться в кросс-платформенной поддержке: оценить поведение на Linux/macOS/Windows (для Windows возможно только process-mode).",
        "Добавить CLI флаг для явного выбора secure/high-security профиля, использующего containerized sandbox.",
        "Обеспечить обратную совместимость: при отсутствии Docker/подобного sandbox v1 продолжает работать."
      ],
      "deliverables": [
        "Containerized sandbox backend с изоляцией процессов, файловой системы и сети.",
        "Интеграция sandbox v2 с terminal/test tools и поддерживающая документация.",
        "Метрики и тесты, подтверждающие безопасность и предсказуемость поведения."
      ],
      "DoD": [
        "Тесты и команды могут запускаться в изолированном окружении без доступа к хостовой системе.",
        "Ресурсные лимиты применяются и предотвращают runaway-процессы.",
        "Документация и конфиги позволяют пользователю осознанно выбирать уровень безопасности.",
        "При отсутствии возможностей containerized sandbox система корректно деградирует до process-mode."
      ],
      "notes": "Это ключевой шаг для использования MyCodex в более строгих и корпоративных окружениях."
    },
    {
      "id": "phase_32",
      "status": "planned",
      "title": "Web/IDE UI Layer: AI Editor Mode",
      "description": "Создание UI-слоя (web/IDE-friendly), обеспечивающего визуализацию патчей, планов, тестов и контекста в духе Cursor.",
      "tasks": [
        "Определить API между backend (mycodexd) и UI слоем для получения информации о сессиях, патчах, тестах, планах и рефлексии.",
        "Реализовать HTTP/WebSocket endpoints для стриминга тех же событий, что получает CLI (tokens, tools, tests, plans, reflect).",
        "Спроектировать минимальный web UI (React/NextJS или аналог) для отображения сессий, исходного кода, диффов и логов.",
        "Добавить компонент просмотра патчей: бок-о-бок сравнение исходного и изменённого кода.",
        "Реализовать отображение плана и рефлексии в удобной для чтения форме (steps timeline).",
        "Добавить панель тестов: статус прогонов, ошибки, логи, фильтры по тестовым сьюитам.",
        "Интегрировать навигационные возможности (phase_29): переход к определениям и ссылкам по клику.",
        "Реализовать базовые UX-паттерны: запуск новой задачи, выбор модели/стратегии, просмотр истории сессий.",
        "Добавить auth/безопасность для удалённого доступа к UI (simple token auth/локальный only first).",
        "Добавить интеграционные тесты для API UI (например, через Playwright или headless-тесты).",
        "Обновить документацию (docs/ui.md) с описанием установки, запуска и возможностей UI.",
        "Добавить возможность подключаться к уже работающему mycodexd и отображать активные сессии.",
        "Продумать и реализовать минимальную интеграцию с популярными IDE (через HTTP/WebSocket API или LSP-like протокол).",
        "Добавить метрики использования UI функций: количество открытых сессий, патч-просмотров, тест-просмотров.",
        "Обеспечить, чтобы UI был опциональным и не ломал headless/CLI-only сценарии."
      ],
      "deliverables": [
        "Базовый web UI или UI-протокол, позволяющий работать с агентом визуально.",
        "API для отображения сессий, патчей, тестов, плана и рефлексии.",
        "Документация по установке и использованию UI слоя."
      ],
      "DoD": [
        "Пользователь может через UI запустить задачу, увидеть план, патчи, тесты и результат.",
        "UI корректно работает параллельно с CLI и не ломает существующий функционал.",
        "Документация полностью покрывает UI-сценарии.",
        "При отсутствии UI сервер продолжает работать как обычный mycodexd."
      ],
      "notes": "Это приближает опыт к Cursor, предоставляя визуальный интерфейс поверх уже мощного backend."
    },
    {
      "id": "phase_33",
      "status": "planned",
      "title": "Autonomous Developer Mode & Multi-Task Backlog",
      "description": "Финальный слой автономности: агент берёт несколько задач из backlog, планирует и последовательно решает их с минимальным участием человека.",
      "tasks": [
        "Определить модель backlog задач: источник (файл, HTTP API, issue tracker), формат описаний задач и статусов.",
        "Реализовать backlog provider, позволяющий агенту читать список задач и обновлять их состояния (in progress, done, blocked).",
        "Добавить high-level планировщик, распределяющий задачи по сессиям и управляющий их последовательным выполнением.",
        "Интегрировать существующие возможности (planning, reflection, tests, patch stack, memory) в рамках нескольких задач подряд.",
        "Добавить конфиги для лимитов автономного режима: максимальное количество задач, длительность сессии, лимит патчей.",
        "Реализовать логирование и метрики автономного режима: количество решённых задач, среднее количество итераций, степень успеха.",
        "Добавить механизмы безопасной остановки: условия, при которых агент обязан остановиться и запросить вмешательство человека.",
        "Интегрировать автономный режим с UI/CLI: отображение состояния backlog и прогресса по задачам.",
        "Добавить unit-тесты для планировщика backlog и его взаимодействия с AgentRunner.",
        "Добавить интеграционные тесты: сценарий, когда агент последовательно решает несколько задач в одном репозитории.",
        "Обновить документацию (docs/autonomous_mode.md) с описанием рисков, конфигов и рекомендаций по использованию.",
        "Реализовать механизмы контроля доступа: автономный режим включается только явно и с подтверждением от пользователя.",
        "Интегрировать память (phase_30), чтобы решения по предыдущим задачам могли использоваться при решении новых.",
        "Реализовать поддержку простых источников backlog (локальный YAML/JSON файл) и предусмотреть расширение до GitHub/Jira в будущем.",
        "Убедиться, что автономный режим не ломает стандартные single-task сценарии и не включается без явного разрешения."
      ],
      "deliverables": [
        "Autonomous Developer Mode, позволяющий агенту последовательно выполнять несколько задач из backlog.",
        "Интеграция backlog, планировщика, агента и UI/CLI.",
        "Документация и демо-сценарии автономной работы."
      ],
      "DoD": [
        "Агент способен самостоятельно выполнить несколько задач из backlog в тестовом репозитории без ручного вмешательства.",
        "Существуют понятные ограничения и механизмы остановки автономного режима.",
        "Метрики и логи позволяют анализировать эффективность и безопасность автономного режима.",
        "Документация подчёркивает экспериментальный/опасный характер режима и способы его безопасного использования."
      ],
      "notes": "Это верхний уровень автономности, приближающий MyCodex к концепции «виртуального разработчика» уровня Devin."
    }
  ]
}
